app/controllers/credit_cards_controller.rb

INSERT INTO "credit_cards" ("holders_name", "number", "card_type", "cvc", "expiry_date", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["holders_name", "a"], ["number", "a"], ["card_type", "a"], ["cvc", "a"], ["expiry_date", "a"], ["user_id", 8]]
---
  def create
    card = CreditCard.new(credit_card_params)
    card.user_id = current_user.id
    card.save